common/emacs/.config/emacs/config.org
#+TITLE: My Config
#+AUTHOR: W. Riddle
#+DESCRIPTION: My Emacs config.
#+STARTUP: showeverything
#+PROPERTY: header-args :tangle yes

* TOC :toc_3: 
- [[#current-issues][Current Issues]]
- [[#setup][Setup]]
  - [[#lexical-binding][Lexical Binding]]
  - [[#disable-gc][Disable GC]]
  - [[#disable-native-compilation][Disable native compilation]]
  - [[#disable-gui-elements][Disable GUI elements]]
  - [[#set-default-window-size][Set default window size]]
  - [[#package-manager][Package Manager]]
  - [[#useful-debugging][Useful debugging]]
- [[#settings--variables][Settings / Variables]]
  - [[#backup-files-directory][Backup files directory]]
  - [[#utf-8][UTF-8]]
  - [[#fonts][Fonts]]
  - [[#os-specific][OS Specific]]
  - [[#line-numbers-and-line-behavior][Line Numbers and Line Behavior]]
  - [[#whitespace][Whitespace]]
  - [[#y-or-n-instead-of-yes-or-no][Y-or-N instead of Yes-or-No]]
  - [[#skip-special-buffers][Skip Special Buffers]]
  - [[#dired-settings][Dired Settings]]
- [[#custom-functions][Custom Functions]]
  - [[#reset-font-zoom][Reset font zoom]]
  - [[#open-config-file][Open config file]]
  - [[#tangle-and-reload-config-file][Tangle and reload config file]]
  - [[#add-trailing-space-to-all-headings-in-org-mode][Add trailing space to all headings in org mode]]
- [[#packages--after-hooks][Packages / After Hooks]]
  - [[#themes][Themes]]
    - [[#ef-themes][EF Themes]]
  - [[#evil][Evil]]
  - [[#general][General]]
  - [[#disabled-which-key][(DISABLED) Which-Key]]
  - [[#nerd-icons][Nerd Icons]]
  - [[#org-mode][Org Mode]]
    - [[#variable-pitch-org-old][Variable Pitch Org (OLD)]]
    - [[#toc-org][toc-org]]
    - [[#org-modern][Org Modern]]
    - [[#org-appear][Org Appear]]
    - [[#org-contrib][Org Contrib]]
    - [[#plantuml][PlantUML]]
  - [[#ultra-scroll-smooth-scrolling][Ultra-scroll (smooth scrolling)]]
  - [[#expand-region][Expand Region]]
  - [[#sudo-edit][Sudo Edit]]
  - [[#hydra][Hydra]]
  - [[#magit][Magit]]
  - [[#lsp][LSP]]
  - [[#packages-to-install][Packages to install]]
- [[#keybinds][Keybinds]]
- [[#other-hooks][Other Hooks]]
  - [[#disabled-prog-mode-line-numbers][(DISABLED) Prog Mode Line Numbers]]
  - [[#show-startup-time][Show startup time]]
- [[#misc][Misc]]
  - [[#disabled-emacs-server][(DISABLED) Emacs Server]]
- [[#helpful-links][Helpful Links]]

* Current Issues 

- ~pixel-scroll-precision-mode~ does not work correctly with a mouse and still skips over large images. ~ultra-scroll~ did not fix it. It will only work if the window is resized at least once after opening emacs. This issue does not occur using the trackpad.


* Setup 


** Lexical Binding 

This needs to be the first line

#+BEGIN_SRC emacs-lisp :tangle "~/.config/emacs/early-init.el"
;; -*- lexical-binding: t; -*-
#+END_SRC

#+BEGIN_SRC emacs-lisp
;; -*- lexical-binding: t; -*-
#+END_SRC


** Disable GC 

Disable GC to make startup faster. This *MUST* be re-enabled at the end, or else it will cause issues like freezing (the ~add-hook~ takes care of this for us).

The hook also ensures that it will run even if the config causes an error.

#+BEGIN_SRC emacs-lisp :tangle "~/.config/emacs/early-init.el"
  ;; Increase GC threshold during startup
  (setq gc-cons-threshold most-positive-fixnum)

  ;; Restore to a sane default after startup (will work if config errors out)
  (add-hook 'emacs-startup-hook
    	  (lambda ()
    	    (setq gc-cons-threshold 1600000)))
#+END_SRC


** Disable native compilation 

Disable native compilation because GCC is not installed.

#+BEGIN_SRC emacs-lisp :tangle "~/.config/emacs/early-init.el"
  ;;(setq package-native-compile nil)
  ;;(setq native-comp-deferred-compilation nil)
  ;;(setq native-comp-jit-compilation nil)
#+END_SRC


** Disable GUI elements 

#+BEGIN_SRC emacs-lisp :tangle "~/.config/emacs/early-init.el"
  (menu-bar-mode -1)
  (tool-bar-mode -1)
  (scroll-bar-mode -1)

  (setq inhibit-startup-screen t)
#+END_SRC


** Set default window size 

#+BEGIN_SRC emacs-lisp :tangle "~/.config/emacs/early-init.el"
  (setq default-frame-alist
        (append default-frame-alist
  	      '((left . 0)
  		(top . 0)
  		(width . 180)
  		(height . 50))))
#+END_SRC


** Package Manager 

Rather than install a package manager, I want to see if the default ~use-package~ along with the ~:vc~ tag for GitHub / specific commits or branches will be enough for me.

#+BEGIN_SRC emacs-lisp

  ;; Load any packages in ~/.config/emacs/lisp
  (add-to-list 'load-path
    	     (expand-file-name "lisp" user-emacs-directory))

  ;; GNU and NonGNU repositories are enabled by default, so no need to specify.
  (setq package-archives
    	     '(("melpa" . "https://melpa.org/packages/")
    	       ("gnu" . "https://elpa.gnu.org/packages/")
    	       ("nongnu" . "https://elpa.nongnu.org/nongnu/")))

  (package-initialize)

  (when (not package-archive-contents)
    (package-refresh-contents))


  (unless (package-installed-p 'use-package)
    (package-install 'use-package))

  (require 'use-package)

  ;; Always install if nto installed.
  (setq use-package-always-ensure t)


#+END_SRC


** Useful debugging 

Enable to turn on debugging if you get unhelpful messages like
=Error (use-package): Cannot load x=.

#+BEGIN_SRC emacs-lisp
  ;; (toggle-debug-on-error)
  (setq use-package-verbose t
        use-package-expand-minimally nil)
#+END_SRC


* Settings / Variables 

#+BEGIN_SRC emacs-lisp
  (electric-pair-mode t)
  (electric-indent-mode 1)
  (show-paren-mode 1)
  (save-place-mode t)
  (savehist-mode t)
  (recentf-mode t)
  (setq recentf-max-menu-items 25)
  (setq recentf-max-saved-items 100)
  (global-auto-revert-mode t)
  (setq completions-format 'vertical)
  (blink-cursor-mode 0)
  (setq fill-column 80)
  (setq display-fill-column-indicator-column 80)
  (setq ring-bell-function 'ignore)
  (column-number-mode 1) ;; show column # in modeline
  (pixel-scroll-precision-mode) ;; should allow smooth scrolling over images in org mode
#+END_SRC

#+BEGIN_SRC emacs-lisp
  (setq uniquify-buffer-name-style 'forward
        window-resize-pixelwise t
        frame-resize-pixelwise t
        load-prefer-newer t
        backup-by-copying t
        global-auto-revert-non-file-buffers t ;; auto revert dired and ibuffer
        kill-do-not-save-duplicates t
        custom-file (expand-file-name "custom.el" user-emacs-directory))
#+END_SRC


Delete selection when typing after selecting text.

#+begin_src emacs-lisp
  (delete-selection-mode 1)
#+end_src


Show column indicator for certain modes.

#+begin_src emacs-lisp
    (dolist (mode '(prog-mode-hook))
      (add-hook mode (lambda ()
    		   (display-fill-column-indicator-mode t))))
#+end_src


Word wrap only wraps at space by default. We could use ~toggle-truncate-lines~ instead of ~visual-line-mode~, but I don't like it wrapping at /any/ character. So instead, I'll modify it to also wrap by things such as slashes (for URLs).

#+begin_src emacs-lisp
  (setq word-wrap-by-category t)
  (modify-category-entry ?/ ?| (standard-category-table))
#+end_src


** Backup files directory 

This prevents emacs from spamming files with tildes everywhere, like =~init.el=.

#+BEGIN_SRC emacs-lisp
  (let ((backup-dir "/tmp/emacs/backups")
        (auto-saves-dir "/tmp/emacs/auto-saves"))
    (dolist (dir (list backup-dir auto-saves-dir))
      (when (not (file-directory-p dir))
        (make-directory dir t)))
    (setq backup-directory-alist `(("." . ,backup-dir))
  	auto-save-file-name-transforms `((".*" ,auto-saves-dir t))
  	auto-save-list-file-prefix (concat auto-saves-dir ".saves-")
  	tramp-backup-directory-alist `((".*" . ,backup-dir))
  	tramp-auto-save-directory auto-saves-dir))

  (setq backup-by-copying t   ;; Don't delete hardlinks
        delete-old-versions t ;; Clean up backups
        version-control t     ;; Use version numbers on backups
        kept-new-versions 5   ;; Keep five new versions
        kept-old-versions 2)  ;; Keep two old versions
#+END_SRC


** UTF-8 

#+BEGIN_SRC emacs-lisp
  (set-language-environment "UTF-8")
  (prefer-coding-system 'utf-8)
  (set-default-coding-systems 'utf-8)
  (set-terminal-coding-system 'utf-8)
  (set-keyboard-coding-system 'utf-8)
  (setq default-buffer-file-coding-system 'utf-8)
#+END_SRC


** Fonts 

#+BEGIN_SRC emacs-lisp
  (setq
   ;; wr/font-mono "SFMono Nerd Font"
   wr/font-mono "JetBrainsMono Nerd Font"
   ;; wr/font-mono "Maple Mono Normal NL NF"
   wr/font-variable "SF Pro"
   wr/font-base-size 140

   ;; These need to be floating point in order for it to scale when
   ;; increasing / decreasing font size via keybinds.
   wr/font-mono-relative-size 1.0
   wr/font-variable-relative-size 1.0)

  (set-face-attribute 'default nil
  		    :font wr/font-mono
  		    :height wr/font-base-size
  		    :weight 'normal)
  (set-face-attribute 'variable-pitch nil
  		    :font wr/font-variable
  		    :height wr/font-variable-relative-size
  		    :weight 'normal)
  (set-face-attribute 'fixed-pitch nil
  		    :font wr/font-mono
  		    :height wr/font-mono-relative-size
  		    :weight 'normal)

  ;; This is needed for emacsclient apparently.
  (add-to-list 'default-frame-alist
  	     (cons 'font
  		   (format "%s-%d" wr/font-mono (/ wr/font-base-size 10))))

  (setq-default line-spacing nil)
#+END_SRC


** OS Specific 

#+BEGIN_SRC emacs-lisp
  (cond ((eq system-type 'darwin)
         ;; Mac
         (custom-set-variables
  	'(mac-command-modifier 'meta)
  	'(mac-option-modifier 'alt)
  	'(mac-right-option-modifier 'super))
         (bind-key "M-0" 'wr/text-scale-reset)
         (bind-key "M-+" 'text-scale-increase)
         (bind-key "M-=" 'text-scale-increase)
         (bind-key "M--" 'text-scale-decrease)
         (use-package exec-path-from-shell
  	   :config
  	   (exec-path-from-shell-initialize))
         )

        ((eq system-type 'windows-nt)
         ;; Windows
         )

        ((eq system-type 'gnu/linux)
         ;; Linux
         ))
#+END_SRC


** Line Numbers and Line Behavior 

#+BEGIN_SRC emacs-lisp
  (global-display-line-numbers-mode 1)
  (global-visual-line-mode t)
#+END_SRC


** Whitespace 

#+BEGIN_SRC emacs-lisp
(custom-set-variables '(show-trailing-whitespace nil)) ;; turns this off because it's annoying and sometimes I keep whitespacing in headings to make it look even
#+END_SRC


** Y-or-N instead of Yes-or-No 


#+begin_src emacs-lisp
  (fset 'yes-or-no-p 'y-or-n-p)
#+end_src


** Skip Special Buffers 

When navigationg using ~previous-buffer~ and ~next-buffer~, this skips the annoying special buffers like ~*Messages*~. Keeps ~*scratch*~ though.

#+begin_src emacs-lisp
  (setq switch-to-prev-buffer-skip-regexp '("\\*Messages\\*"
  					  "\\*Warnings\\*"
  					  "\\*Help\\*"
  					  "\\*Completions\\*"
  					  "\\*Compile-Log\\*"
  					  "\\*Ibuffer\\*"
  					  "\\*Native-compile-Log"))
#+end_src


** Dired Settings 

#+begin_src emacs-lisp
  ;; Stop dired from spawning so many buffers when navigating
  (setq dired-kill-when-opening-new-dired-buffer t)
#+end_src


* Custom Functions 

** Reset font zoom 

#+BEGIN_SRC emacs-lisp
  (defun wr/text-scale-reset ()
    (interactive)
    (text-scale-set 0))
#+END_SRC


