common/emacs/.config/emacs/config.el
;; -*- lexical-binding: t; -*-

;; Load any packages in ~/.config/emacs/lisp
(add-to-list 'load-path
  	     (expand-file-name "lisp" user-emacs-directory))

;; GNU and NonGNU repositories are enabled by default, so no need to specify.
(setq package-archives
  	     '(("melpa" . "https://melpa.org/packages/")
  	       ("gnu" . "https://elpa.gnu.org/packages/")
  	       ("nongnu" . "https://elpa.nongnu.org/nongnu/")))

(package-initialize)

(when (not package-archive-contents)
  (package-refresh-contents))


(unless (package-installed-p 'use-package)
  (package-install 'use-package))

(require 'use-package)

;; Always install if nto installed.
(setq use-package-always-ensure t)

(setq use-package-verbose t
      use-package-expand-minimally nil)

(electric-pair-mode t)
(electric-indent-mode 1)
(show-paren-mode 1)
(save-place-mode t)
(savehist-mode t)
(recentf-mode t)
(setq recentf-max-menu-items 25)
(setq recentf-max-saved-items 100)
(global-auto-revert-mode t)
(setq completions-format 'vertical)

(setq uniquify-buffer-name-style 'forward
      window-resize-pixelwise t
      frame-resize-pixelwise t
      load-prefer-newer t
      backup-by-copying t
      custom-file (expand-file-name "custom.el" user-emacs-directory))

(let ((backup-dir "/tmp/emacs/backups")
      (auto-saves-dir "/tmp/emacs/auto-saves"))
  (dolist (dir (list backup-dir auto-saves-dir))
    (when (not (file-directory-p dir))
      (make-directory dir t)))
  (setq backup-directory-alist `(("." . ,backup-dir))
	auto-save-file-name-transforms `((".*" ,auto-saves-dir t))
	auto-save-list-file-prefix (concat auto-saves-dir ".saves-")
	tramp-backup-directory-alist `((".*" . ,backup-dir))
	tramp-auto-save-directory auto-saves-dir))

(setq backup-by-copying t   ;; Don't delete hardlinks
      delete-old-versions t ;; Clean up backups
      version-control t     ;; Use version numbers on backups
      kept-new-versions 5   ;; Keep five new versions
      kept-old-versions 2)  ;; Keep two old versions

(set-language-environment "UTF-8")
(prefer-coding-system 'utf-8)
(set-default-coding-systems 'utf-8)
(set-terminal-coding-system 'utf-8)
(set-keyboard-coding-system 'utf-8)
(setq default-buffer-file-coding-system 'utf-8)

(setq
 ;; wr/font-mono "SFMono Nerd Font"
 wr/font-mono "JetBrainsMono Nerd Font"
 ;; wr/font-mono "Maple Mono Normal NL NF"
 wr/font-variable "SF Pro"
 wr/font-base-size 140

 ;; These need to be floating point in order for it to scale when
 ;; increasing / decreasing font size via keybinds.
 wr/font-mono-relative-size 1.0
 wr/font-variable-relative-size 1.0)

(set-face-attribute 'default nil
		    :font wr/font-mono
		    :height wr/font-base-size
		    :weight 'normal)
(set-face-attribute 'variable-pitch nil
		    :font wr/font-variable
		    :height wr/font-variable-relative-size
		    :weight 'normal)
(set-face-attribute 'fixed-pitch nil
		    :font wr/font-mono
		    :height wr/font-mono-relative-size
		    :weight 'normal)

;; This is needed for emacsclient apparently.
(add-to-list 'default-frame-alist
	     (cons 'font
		   (format "%s-%d" wr/font-mono (/ wr/font-base-size 10))))

(setq-default line-spacing nil)

(cond ((eq system-type 'darwin)
       ;; Mac
       (custom-set-variables
	'(mac-command-modifier 'meta)
	'(mac-option-modifier 'alt)
	'(mac-right-option-modifier 'super))
       (bind-key "M-0" 'wr/text-scale-reset)
       (bind-key "M-+" 'text-scale-increase)
       (bind-key "M-=" 'text-scale-increase)
       (bind-key "M--" 'text-scale-decrease)
       (use-package exec-path-from-shell
	   :config
	   (exec-path-from-shell-initialize))
       )

      ((eq system-type 'windows-nt)
       ;; Windows
       )

      ((eq system-type 'gnu/linux)
       ;; Linux
       ))

(global-display-line-numbers-mode 1)
(global-visual-line-mode t)

(custom-set-variables '(show-trailing-whitespace t))

(fset 'yes-or-no-p 'y-or-n-p)

(setq switch-to-prev-buffer-skip-regexp '("\\*Messages\\*"
					  "\\*Warnings\\*"
					  "\\*Help\\*"
					  "\\*Completions\\*"
					  "\\*Compile-Log\\*"
					  "\\*Native-compile-Log"))

(defun wr/text-scale-reset ()
  (interactive)
  (text-scale-set 0))
