common/emacs/.config/emacs/config.org
** Open config file 

#+BEGIN_SRC emacs-lisp
  (defun wr/open-config-org ()
    (interactive)
    (find-file "~/.config/emacs/config.org"))
#+END_SRC


** Tangle and reload config file 

#+BEGIN_SRC emacs-lisp
  (defun wr/tangle-and-reload-config ()
    (interactive)
    (message "Tangling file %s" (expand-file-name "config.org" user-emacs-directory))
    (org-babel-tangle-file (expand-file-name "config.org" user-emacs-directory))
    (load-file (expand-file-name "config.el" user-emacs-directory)))
#+END_SRC


** Add trailing space to all headings in org mode 

The current theme looks better when there is a space at the end of all headings. This will add spaces to the end of all headings if there isn't already a space.

#+begin_src emacs-lisp
  (defun wr/org-add-trailing-space-to-headings ()
    "Ensures every org heading ends with a trailing space."
    (interactive)
    (save-excursion
      (goto-char (point-min))
      (while (re-search-forward "^\\*+ " nil t)
        (end-of-line)
        (unless (eq (char-before) ?\s)
  	(insert " ")))))
#+end_src


* Packages / After Hooks 

** Themes 

*** EF Themes 

#+BEGIN_SRC emacs-lisp
  (use-package ef-themes
    :vc (:url "https://github.com/protesilaos/ef-themes" :rev :newest)
    :init
    (ef-themes-take-over-modus-themes-mode 1)
    :config
    (setq modus-themes-italic-constructs nil)
    (modus-themes-load-theme 'ef-duo-light))
#+END_SRC


** Evil 

#+BEGIN_SRC emacs-lisp
  (use-package evil
    :demand t
    :init
    (setq evil-want-integration t)
    (setq evil-want-keybinding nil)
    (setq evil-vsplit-window-right t)
    (setq evil-split-window-below t)
    (setq evil-want-C-u-scroll t)
    (setq evil-want-C-i-jump t)
    (setq evil-want-C-w-delete nil)
    (setq evil-want-Y-yank-to-eol t)
    (setq evil-respect-visual-line-mode t)
    (setq evil-kill-on-visual-paste nil)
    ;; (setq evil-undo-system undo-tree) ;; or undo-fu
    :config
    (evil-mode 1))

  (use-package evil-collection
    :after evil
    :config
    (evil-collection-init))
#+END_SRC

#+BEGIN_SRC emacs-lisp
  (use-package evil-commentary
    :config
    (evil-commentary-mode))
#+END_SRC


** General 

#+BEGIN_SRC emacs-lisp
  (use-package general
    :config
    (general-evil-setup))
#+END_SRC


** (DISABLED) Which-Key 

Rather than having which-key pop up all the time, just use ~C-h~ to popup a keymap on the side. That way it's on-demand, rather that popping up constantly.

#+BEGIN_SRC emacs-lisp :tangle no
  ;; ISSUE: which-key is blocked by echo area at the bottom. I'm not sure why.
  ;; Hacky solution at https://discourse.doomemacs.org/t/echo-area-covers-bottom-of-which-key/3026/2
  ;; for Doom, haven't found a solution for vanilla.
  ;;
  ;; (defadvice! fix-which-key--show-popup (fn act-popup-dim)
  ;; :around #'which-key--show-popup
  ;; (let ((height (car act-popup-dim))
  ;;       (width  (cdr act-popup-dim)))
  ;;   (funcall fn (cons (+ height 1) width))))
  (use-package which-key
    :init
    (which-key-mode 1)
    :config
    (setq which-key-side-window-location 'bottom
  	which-key-sort-order #'which-key-key-order-alpha
  	which-key-sort-uppercase-first nil
  	which-key-add-column-padding 1
  	which-key-max-display-columns nil
  	which-key-min-display-lines 6
  	which-key-side-window-slot -10
  	which-key-side-window-max-height 0.25
  	which-key-idle-delay 0.8
  	which-key-max-description-length 30
  	which-key-allow-imprecise-window-fit t))
  	;;which-key-separator "  "))
#+END_SRC


** Nerd Icons 

#+BEGIN_SRC emacs-lisp
  (use-package nerd-icons)
#+END_SRC


** Org Mode 

See [[file:moderntest.org][moderntest.org]] for org modern / org mode styling tests.

#+BEGIN_SRC emacs-lisp
  (use-package org
    :after nerd-icons
    :custom
    (org-directory "~/org")
    (org-log-done 'time)
    (org-startup-indented t)
    (org-log-into-drawer t)
    (org-special-ctrl-a/e t)
    (org-special-ctrl-k t)
    (org-confirm-babel-evaluate t)
    (org-src-fontify-natively t)
    (org-src-tab-acts-natively t)
    (org-hide-emphasis-markers t)
    (prettify-symbols-unprettify-at-point 'right-edge)
    (org-fontify-done-headline nil)
    (org-fontify-whole-heading-line nil) ;; made the heading go across the whole line
    (org-cycle-separator-lines 1) ;; this ensures that collapsing all headings still keeps at least 1 space between headings
    (org-tags-column 0)
    ;; (org-list-indent-offset 2) ;; add a little extra indent to make it look good
    (org-list-indent-offset 0)
    (org-startup-with-inline-images t) ;; show inline images
    (x-underline-at-descent-line t)
    (org-todo-keywords '((sequence "TODO(t)"
   				 "NEXT(n!/!)"
   				 "WAITING(w@!/!)"
   				 "|"
   				 "DONE(d!)"
   				 "CANCELED(c@!)")
                         (sequence "INBOX(i)"
   				 "PROJECT(p)"
   				 "IDEA(I)"
   				 "NOTE(o)")))
    (org-todo-keyword-faces
     '(("INBOX" . "DarkOrchid1")
       ("PROJECT" . +org-todo-test)
       ("WAITING" :background "blue")))
    :custom-face
    ;;(org-done ((nil (:strike-through t :foreground "#808080"))))
    ;;(org-headline-done ((nil (:strike-through t :foreground "#808080"))))
    (org-document-title ((t (:height 1.1 :weight bold))))
    (org-level-1 ((t (:height 1.1 :weight bold :background "#F9D4A0" :foreground "#000000" :overline "#000000" :underline "#000000"))))
    (org-level-2 ((t (:height 1.1 :weight bold :background "#EDE4FC" :foreground "#000000" :overline "#000000" :underline "#000000"))))
    (org-level-3 ((t (:height 1.1 :weight bold :background "#FCE4C8" :foreground "#000000" :overline "#000000" :underline "#000000"))))
    (org-level-4 ((t (:height 1.1 :weight bold :background "#C8E0F0" :foreground "#000000" :overline "#000000" :underline "#000000"))))
    (org-level-5 ((t (:height 1.1 :weight bold :background "#FAD0B8" :foreground "#000000" :overline "#000000" :underline "#000000"))))
    (org-level-6 ((t (:height 1.1 :weight bold :background "#D4ECD4" :foreground "#000000" :overline "#000000" :underline "#000000"))))
    (org-level-7 ((t (:height 1.1 :weight bold :background "#F0C8E0" :foreground "#000000" :overline "#000000" :underline "#000000"))))
    (org-level-8 ((t (:height 1.1 :weight bold :background "#F5EAA0" :foreground "#000000" :overline "#000000" :underline "#000000"))))
    ;; (org-level-1 ((t (:height 1.1 :weight bold :background "#F9D4A0" :foreground "#000000" ))))
    ;; (org-level-2 ((t (:height 1.1 :weight bold :background "#EDE4FC" :foreground "#000000" ))))
    ;; (org-level-3 ((t (:height 1.1 :weight bold :background "#FCE4C8" :foreground "#000000" ))))
    ;; (org-level-4 ((t (:height 1.1 :weight bold :background "#C8E0F0" :foreground "#000000" ))))
    ;; (org-level-5 ((t (:height 1.1 :weight bold :background "#FAD0B8" :foreground "#000000" ))))
    ;; (org-level-6 ((t (:height 1.1 :weight bold :background "#D4ECD4" :foreground "#000000" ))))
    ;; (org-level-7 ((t (:height 1.1 :weight bold :background "#F0C8E0" :foreground "#000000" ))))
    ;; (org-level-8 ((t (:height 1.1 :weight bold :background "#F5EAA0" :foreground "#000000" ))))
    :hook
    (org-mode . (lambda ()
               	(set-fontset-font t 'symbol (font-spec :family "Symbols Nerd Font Mono") nil 'prepend)
               	(set-fontset-font "fontset-default" 'unicode '("Symbols Nerd Font Mono"))
               	(setq prettify-symbols-alist '(("[ ]" . "󰄱" )
   					       ("[X]" . "󰱒")
   					       ("[-]" . "󰛲")))
               	(prettify-symbols-mode)))
    :config
    (org-babel-do-load-languages
     'org-babel-load-languages
     '((ruby . t)
       (latex . t)
       (plantuml . t)
       (python . t)
       (shell . t)
       (dot . t)
       (org . t)))
    (add-to-list 'org-src-lang-modes '("plantuml" . plantuml))
    )

  ;; redisplay images after executing code blocks
  (add-hook 'org-babel-after-execute-hook 'org-redisplay-inline-images)

  (with-eval-after-load 'org
    (setq org-structure-template-alist
          '(("c" . "center")
            ("ex" . "export")
            ("ea" . "export ascii")
            ("eh" . "export html")
            ("el" . "export latex")
            ("E" . "example")
            ("q" . "quote")
            ("s" . "src")
            ("1" . "src emacs-lisp")
            ("2" . "src java")
            ("v" . "verse"))))
#+END_SRC



