common/emacs/.config/emacs/config.el

(defun wr/open-config-org ()
  (interactive)
  (find-file "~/.config/emacs/config.org"))

(defun wr/tangle-and-reload-config ()
  (interactive)
  (message "Tangling file %s" (expand-file-name "config.org" user-emacs-directory))
  (org-babel-tangle-file (expand-file-name "config.org" user-emacs-directory))
  (load-file (expand-file-name "config.el" user-emacs-directory)))

(use-package ef-themes
  :vc (:url "https://github.com/protesilaos/ef-themes" :rev :newest)
  :init
  (ef-themes-take-over-modus-themes-mode 1)
  :config
  (setq modus-themes-italic-constructs nil)
  (modus-themes-load-theme 'ef-duo-light))

(use-package evil
  :demand t
  :init
  (setq evil-want-integration t)
  (setq evil-want-keybinding nil)
  (setq evil-vsplit-window-right t)
  (setq evil-split-window-below t)
  (setq evil-want-C-u-scroll t)
  (setq evil-want-C-i-jump t)
  (setq evil-want-C-w-delete nil)
  (setq evil-want-Y-yank-to-eol t)
  (setq evil-respect-visual-line-mode t)
  (setq evil-kill-on-visual-paste nil)
  ;; (setq evil-undo-system undo-tree) ;; or undo-fu
  :config
  (evil-mode 1))

(use-package evil-collection
  :after evil
  :config
  (evil-collection-init))

(use-package evil-commentary
  :config
  (evil-commentary-mode))

(use-package general
  :config
  (general-evil-setup))

(use-package which-key
  :init
  (which-key-mode 1)
  :config
  (setq which-key-side-window-location 'bottom
	which-key-sort-order #'which-key-key-order-alpha
	which-key-sort-uppercase-first nil
	which-key-add-column-padding 1
	which-key-max-display-columns nil
	which-key-min-display-lines 6
	which-key-side-window-slot -10
	which-key-side-window-max-height 0.25
	which-key-idle-delay 0.8
	which-key-max-description-length 30
	which-key-allow-imprecise-window-fit t))
	;;which-key-separator "  "))

(use-package nerd-icons)

(use-package org
  :after nerd-icons
  :custom
  (org-directory "~/org")
  (org-log-done 'time)
  (org-startup-indented t)
  (org-log-into-drawer t)
  (org-special-ctrl-a/e t)
  (org-special-ctrl-k t)
  (org-confirm-babel-evaluate t)
  (org-src-fontify-natively t)
  (org-src-tab-acts-natively t)
  (org-hide-emphasis-markers t)
  (prettify-symbols-unprettify-at-point 'right-edge)
