common/emacs/.config/emacs/config.org
*** Variable Pitch Org (OLD) 

#+BEGIN_SRC emacs-lisp :tangle no
  (use-package mixed-pitch
    :hook
    (text-mode . mixed-pitch-mode))

  (use-package org
    :after nerd-icons
    :custom
    (org-directory "~/org")
    (org-log-done 'time)
    (org-startup-indented t)
    (org-log-into-drawer t)
    (org-special-ctrl-a/e t)
    (org-special-ctrl-k t)
    (org-confirm-babel-evaluate t)
    (org-src-fontify-natively t)
    (org-src-tab-acts-natively t)
    (org-hide-emphasis-markers t)
    (prettify-symbols-unprettify-at-point 'right-edge)
    (org-fontify-done-headline t)
    (org-fontify-whole-heading-line t)
    (org-tags-column 0)
    (org-list-indent-offset 2)
    (x-underline-at-descent-line t)
    (org-todo-keywords '((sequence "TODO(t)"
  				 "NEXT(n!/!)"
  				 "WAITING(w@!/!)"
  				 "|"
  				 "DONE(d!)"
  				 "CANCELED(c@!)")
                         (sequence "PROJECT(p)"
  				 "IDEA(i)"
  				 "NOTE(o)")))
    (org-todo-keyword-faces
     '(("AREA" . "DarkOrchid1")
       ("[AREA]" . "DarkOrchid1")))
    :custom-face
    ;; (org-indent ((nil (:inherit (org-hide fixed-pitch)))))
    (org-done ((nil (:strike-through t :foreground "#808080"))))
    (org-headline-done ((nil (:strike-through t :foreground "#808080"))))
    ;; (org-block ((nil (:inherit fixed-pitch))))
    ;; (org-block-begin-line ((nil (:inherit fixed-pitch))))
    ;; (org-block-end-line ((nil (:inherit fixed-pitch))))
    ;; (org-verbatim ((nil (:inherit fixed-pitch))))
    ;; (org-table ((nil (:inherit fixed-pitch))))
    ;; (org-meta-line ((nil (:inherit fixed-pitch))))
    ;; (org-special-keyword ((nil (:inherit fixed-pitch))))
    ;; (org-document-info ((nil (:inherit fixed-pitch))))
    ;; (org-document-info-keyword ((nil (:inherit fixed-pitch))))
    ;; (org-code ((nil (:inherit (shadow fixed-pitch)))))
    ;; (org-list-dt ((nil (:inherit fixed-pitch))))
    ;; (line-number ((nil (:inherit fixed-pitch))))
    ;; (line-number-current-line ((nil (:inherit fixed-pitch))))
    ;; (org-document-title ((t (:inherit variable-pitch :height 1.1 :weight bold))))
    ;; (org-level-1 ((t (:inherit variable-pitch :height 1.1 :weight bold))))
    ;; (org-level-2 ((t (:inherit variable-pitch :height 1.1 :weight bold))))
    ;; (org-level-3 ((t (:inherit variable-pitch :height 1.1 :weight bold))))
    ;; (org-level-4 ((t (:inherit variable-pitch :height 1.1 :weight bold))))
    ;; (org-level-5 ((t (:inherit variable-pitch :height 1.1 :weight bold))))
    ;; (org-level-6 ((t (:inherit variable-pitch :height 1.1 :weight bold))))
    ;; (org-level-7 ((t (:inherit variable-pitch :height 1.1 :weight bold))))
    (org-document-title ((t (:height 1.1 :weight bold))))
    (org-level-1 ((t (:height 1.1 :weight bold :background "#F9D4A0" :foreground "#000000" :overline "#000000" :underline "#000000"))))
    (org-level-2 ((t (:height 1.1 :weight bold :background "#EDE4FC" :foreground "#000000" :overline "#000000" :underline "#000000"))))
    (org-level-3 ((t (:height 1.1 :weight bold :background "#FCE4C8" :foreground "#000000" :overline "#000000" :underline "#000000"))))
    (org-level-4 ((t (:height 1.1 :weight bold :background "#C8E0F0" :foreground "#000000" :overline "#000000" :underline "#000000"))))
    (org-level-5 ((t (:height 1.1 :weight bold :background "#FAD0B8" :foreground "#000000" :overline "#000000" :underline "#000000"))))
    (org-level-6 ((t (:height 1.1 :weight bold :background "#D4ECD4" :foreground "#000000" :overline "#000000" :underline "#000000"))))
    (org-level-7 ((t (:height 1.1 :weight bold :background "#F0C8E0" :foreground "#000000" :overline "#000000" :underline "#000000"))))
    (org-level-8 ((t (:height 1.1 :weight bold :background "#F5EAA0" :foreground "#000000" :overline "#000000" :underline "#000000"))))
    :hook
    (org-mode . (lambda ()
              	(set-fontset-font t 'symbol (font-spec :family "Symbols Nerd Font Mono") nil 'prepend)
              	(set-fontset-font "fontset-default" 'unicode '("Symbols Nerd Font Mono"))
              	(setq prettify-symbols-alist '(("[ ]" . "󰄱" )
                                                 ("[X]" . "󰱒")
                                                 ("[-]" . "󰛲")))
              	(prettify-symbols-mode)
  		(org-toggle-pretty-entities 1))) ;; prettify some latex entities like ast{}, alpha{}, pi{}, euro{}, tilde{}, etc.
    :config
    (org-babel-do-load-languages
     'org-babel-load-languages
     '((ruby . t)
       (latex . t)
       (plantuml . t)
       (python . t)
       (shell . t)
       (dot . t)
       (org . t)))
    )


  (with-eval-after-load 'org
    (setq org-structure-template-alist
          '(("c" . "center")
            ("ex" . "export")
            ("ea" . "export ascii")
            ("eh" . "export html")
            ("el" . "export latex")
            ("E" . "example")
            ("q" . "quote")
            ("s" . "src")
            ("1" . "src emacs-lisp")
            ("2" . "src java")
            ("v" . "verse"))))
#+END_SRC


*** toc-org 

#+BEGIN_SRC emacs-lisp
  (use-package toc-org
    :commands toc-org-enable
    :init (add-hook 'org-mode-hook 'toc-org-enable))
#+END_SRC


*** Org Modern 

#+BEGIN_SRC emacs-lisp
  (defface wr/org-modern-todo-todo
    '((t :background "#FF9E9E" ;; red
         :foreground "#000000"
         :box (:line-width -1 :color "#000000")))
    "Todo todo face.")

  (defface wr/org-modern-todo-next
    '((t :background "gray90" ;; gray
         :foreground "#000000"
         :box (:line-width -1 :color "#000000")))
    "Next todo face.")

  (defface wr/org-modern-todo-waiting
    '((t :background "#FFAC63" ;; orange
         :foreground "#000000"
         :box (:line-width -1 :color "#000000")))
    "Waiting todo face.")

  (defface wr/org-modern-todo-done
    '((t :background "#9EFFB0" ;; green
         :foreground "#000000"
         :box (:line-width -1 :color "#000000")))
    "Done todo face.")

  (defface wr/org-modern-todo-canceled
    '((t :background "#C72626" ;; dark red
         :foreground "#FFFFFF"
         :box (:line-width -1 :color "#000000")))
    "Canceled todo face.")

  (defface wr/org-modern-todo-inbox
    '((t :background "gold" ;; yellow
         :foreground "#000000"
         :box (:line-width -1 :color "#000000")))
    "Inbox todo face.")

  (defface wr/org-modern-todo-project
    '((t :background "#D4BFFF" ;; purple
         :box (:line-width -1 :color "#000000")))
    "Project todo face.")

  (defface wr/org-modern-todo-idea
    '((t :background "#BFFFF6" ;; cyan
         :box (:line-width -1 :color "#000000")))
    "Idea todo face.")

  (defface wr/org-modern-todo-note
    '((t :background "#9ECDFF" ;; blue
         :box (:line-width -1 :color "#000000")))
    "Note todo face.")


  (use-package org-modern
    :custom
    (org-modern-label-border 0.1)
    (org-modern-star 'replace)
    ;;(org-modern-replace-stars "")
    (org-modern-replace-stars "     ")
    (org-modern-table-horizontal 3)
    (org-modern-checkbox '((?X . "󰱒")
  			 (?- . "󰛲")
  			 (?\s . "󰄱")))
    (org-modern-list '((?+ . "◦")
  		     (?- . "•")
  		     (?* . "•")))
    (org-modern-todo-faces
     '(("TODO" . wr/org-modern-todo-todo)
       ("NEXT" . wr/org-modern-todo-next)
       ("WAITING" . wr/org-modern-todo-waiting)
       ("DONE" . wr/org-modern-todo-done)
       ("CANCELED" . wr/org-modern-todo-canceled)
       ("INBOX" . wr/org-modern-todo-inbox)
       ("PROJECT" . wr/org-modern-todo-project)
       ("IDEA" . wr/org-modern-todo-idea)
       ("NOTE" . wr/org-modern-todo-note)))
    :custom-face
    (org-modern-label ((t (:inherit fixed-pitch :height 1.0 ))))
    :hook
    (org-mode . org-modern-mode))
#+END_SRC


*** Org Appear 

#+BEGIN_SRC emacs-lisp
  (use-package org-appear
    :vc (:url "https://github.com/awth13/org-appear" :rev :newest)
    :after org
    :hook
    (org-mode . org-appear-mode))
#+END_SRC


*** Org Contrib 

Add this so I can get ~ox-extras~ so that I can ~:ignore:~ headings I don't want to export.

#+begin_src emacs-lisp
  (use-package org-contrib
    :config
    (require 'ox-extra)
    (ox-extras-activate '(ignore-headlines)))
#+end_src


*** PlantUML 

#+begin_src emacs-lisp
  (setq org-plantuml-jar-path (expand-file-name "~/lsp/plantuml-1.2026.2.jar"))
#+end_src


** Ultra-scroll (smooth scrolling) 

#+BEGIN_SRC emacs-lisp
  (use-package ultra-scroll
    :vc (:url "https://github.com/jdtsmith/ultra-scroll" :rev :newest)
    :init
    (setq scroll-conservatively 3
          scroll-margin 0)
    :config
    (ultra-scroll-mode 1))
#+END_SRC


** Expand Region 

#+BEGIN_SRC emacs-lisp
  (use-package expand-region)
#+END_SRC


** Sudo Edit 

This is useful if we edit a file, only to find out we needed sudo privileges.

#+begin_src emacs-lisp
  (use-package sudo-edit)
#+end_src


** Hydra 


#+begin_src emacs-lisp
  (use-package hydra
    :after evil
    :defer t)

  (defun wr/evil-window-increase-width-five ()
    "Increase window width by 5"
    (interactive)
    (evil-window-increase-width 5))

  (defun wr/evil-window-decrease-width-five ()
    "Decrease window width by 5"
    (interactive)
    (evil-window-decrease-width 5))

  (defhydra hydra-window-resize ()
    "resize"
    ("<" wr/evil-window-decrease-width-five "-width")
    (">" wr/evil-window-increase-width-five "+width")
    ("-" evil-window-decrease-height "-height")
    ("_" evil-window-decrease-height "-height")
    ("+" evil-window-increase-height "+height")
    ("=" balance-windows "balance"))

  (dolist (key '("<" ">" "-" "_" "+" "="))
    (define-key evil-window-map (kbd key) 'hydra-window-resize/body))
#+end_src


** Magit 

#+begin_src emacs-lisp
  (use-package magit
    :defer t
    ;; :commands
    ;; (magit-status magit-get-current-branch)
    :custom
    ;; Open in the same window, not a different window
    ;;(magit-display-buffer-function #'magit-display-buffer-same-window-except-diff-v1)
    ;; Show character level changes
    (magit-diff-refine-hunk 'all))
#+end_src


** TODO LSP 





** TODO Packages to install 

- Company / LSP
- Vertico
- Consult
- savehist?
- marginalia?
- swiper?
- flycheck?
- rainbow parens?
- neotree / treemacs?
- undo tree / undofu
- harpoon
- consult-xref-stack
- Bufler?
- dumb-jump? (not sure I need this yet)

- [X] Magit

- Go through old config in ~~/.config/emacs/old_config_todo/~
- how to mark buffers to delete?


