common/emacs/.config/emacs/config.el
  (org-fontify-done-headline t)
  (org-fontify-whole-heading-line t)
  (org-tags-column 0)
  (org-list-indent-offset 2) ;; add a little extra indent to make it look good
  (x-underline-at-descent-line t)
  (org-todo-keywords '((sequence "TODO(t)"
				 "NEXT(n!/!)"
				 "WAITING(w@!/!)"
				 "|"
				 "DONE(d!)"
				 "CANCELED(c@!)")
                       (sequence "PROJECT(p)"
				 "IDEA(i)"
				 "NOTE(o)")))
  (org-todo-keyword-faces
   '(("AREA" . "DarkOrchid1")
     ("[AREA]" . "DarkOrchid1")))
  :custom-face
  (org-done ((nil (:strike-through t :foreground "#808080"))))
  (org-headline-done ((nil (:strike-through t :foreground "#808080"))))
  (org-document-title ((t (:height 1.1 :weight bold))))
  (org-level-1 ((t (:height 1.1 :weight bold :background "#F9D4A0" :foreground "#000000" :overline "#000000" :underline "#000000"))))
  (org-level-2 ((t (:height 1.1 :weight bold :background "#EDE4FC" :foreground "#000000" :overline "#000000" :underline "#000000"))))
  (org-level-3 ((t (:height 1.1 :weight bold :background "#FCE4C8" :foreground "#000000" :overline "#000000" :underline "#000000"))))
  (org-level-4 ((t (:height 1.1 :weight bold :background "#C8E0F0" :foreground "#000000" :overline "#000000" :underline "#000000"))))
  (org-level-5 ((t (:height 1.1 :weight bold :background "#FAD0B8" :foreground "#000000" :overline "#000000" :underline "#000000"))))
  (org-level-6 ((t (:height 1.1 :weight bold :background "#D4ECD4" :foreground "#000000" :overline "#000000" :underline "#000000"))))
  (org-level-7 ((t (:height 1.1 :weight bold :background "#F0C8E0" :foreground "#000000" :overline "#000000" :underline "#000000"))))
  (org-level-8 ((t (:height 1.1 :weight bold :background "#F5EAA0" :foreground "#000000" :overline "#000000" :underline "#000000"))))
  :hook
  (org-mode . (lambda ()
            	(set-fontset-font t 'symbol (font-spec :family "Symbols Nerd Font Mono") nil 'prepend)
            	(set-fontset-font "fontset-default" 'unicode '("Symbols Nerd Font Mono"))
            	(setq prettify-symbols-alist '(("[ ]" . "󰄱" )
                                               ("[X]" . "󰱒")
                                               ("[-]" . "󰛲")))
            	(prettify-symbols-mode)))
  :config
  (org-babel-do-load-languages
   'org-babel-load-languages
   '((ruby . t)
     (latex . t)
     (plantuml . t)
     (python . t)
     (shell . t)
     (dot . t)
     (org . t)))
  )


(with-eval-after-load 'org
  (setq org-structure-template-alist
        '(("c" . "center")
          ("ex" . "export")
          ("ea" . "export ascii")
          ("eh" . "export html")
          ("el" . "export latex")
          ("E" . "example")
          ("q" . "quote")
          ("s" . "src")
          ("1" . "src emacs-lisp")
          ("2" . "src java")
          ("v" . "verse"))))

(use-package toc-org
  :commands toc-org-enable
  :init (add-hook 'org-mode-hook 'toc-org-enable))

(use-package org-modern
  :custom
  (org-modern-label-border 0.1)
  (org-modern-star 'replace)
  ;;(org-modern-replace-stars "")
  (org-modern-replace-stars "     ")
  (org-modern-table-horizontal 3)
  (org-modern-checkbox '((?X . "󰱒")
			 (?- . "󰛲")
			 (?\s . "󰄱")))
  (org-modern-list '((?+ . "◦")
		     (?- . "•")
		     (?* . "•")))

  :custom-face
  (org-modern-label ((t (:inherit fixed-pitch :height 1.0 ))))
  :hook
  (org-mode . org-modern-mode))

(use-package org-appear
  :vc (:url "https://github.com/awth13/org-appear" :rev :newest)
  :after org
  :hook
  (org-mode . org-appear-mode))

(use-package org-contrib
  :config
  (require 'ox-extra)
  (ox-extras-activate '(ignore-headlines)))

(use-package ultra-scroll
  :vc (:url "https://github.com/jdtsmith/ultra-scroll" :rev :newest)
  :init
  (setq scroll-conservatively 3
        scroll-margin 0)
  :config
  (ultra-scroll-mode 1))

(use-package expand-region)

(use-package sudo-edit)

(use-package hydra
  :after evil
  :defer t)

(defun wr/evil-window-increase-width-five ()
  "Increase window width by 5"
  (interactive)
  (evil-window-increase-width 5))

(defun wr/evil-window-decrease-width-five ()
  "Decrease window width by 5"
  (interactive)
  (evil-window-decrease-width 5))

(defhydra hydra-window-resize ()
  "resize"
  ("<" wr/evil-window-decrease-width-five "-width")
  (">" wr/evil-window-increase-width-five "+width")
  ("-" evil-window-decrease-height "-height")
  ("_" evil-window-decrease-height "-height")
  ("+" evil-window-increase-height "+height")
  ("=" balance-windows "balance"))

(dolist (key '("<" ">" "-" "_" "+" "="))
  (define-key evil-window-map (kbd key) 'hydra-window-resize/body))
