common/emacs/.config/emacs/config.el

(with-eval-after-load 'general
  (general-define-key
   :states '(normal visual)
   "}" 'next-buffer
   "{" 'previous-buffer
   "M-;" 'evil-commentary
   "C-=" 'er/expand-region)

  (general-create-definer leader-keys
    :prefix "SPC"
    :global-prefix "C-S-SPC")

  (general-create-definer local-leader-keys
    :prefix "SPC m"
    :global-prefix "C-S-SPC m")

  (leader-keys
    :states '(normal visual insert emacs)
    :keymaps 'override
    "b" '(:ignore t :wk "buffer")
    "b b" '(switch-to-buffer :wk identity)
    "b i" '(ibuffer :wk identity)
    "b d" '(kill-current-buffer :wk identity)
    "b D" '(kill-buffer :wk identity)
    "b n" '(next-buffer :wk identity)
    "b p" '(previous-buffer :wk identity)
    "b r" '(revert-buffer :wk "reload buffer")

    "B" '(:ignore t :wk "bookmarks TODO")
    ;; Bb/BB list bookmarks
    ;; Bg list global bookmarks? (bookmarks that are always saved in config.org?)
    ;; Bt toggle bookmark
    ;; Bx clear non-global bookmarks?
    ;; Ba annotate bookmark?
    ;; Bj move down?
    ;; Bk move up?
    ;; Bn next bookmark?
    ;; Bp previous bookmark?


    "d" '(:ignore t :wk "dired TODO")
    "d d" '(dired :wk identity)

    "e" '(:ignore t :wk "eval")
    "e b" '(eval-buffer :wk identity)
    "e d" '(eval-defun :wk identity)
    "e e" '(eval-expression :wk identity)
    "e l" '(eval-last-sexp :wk identity)
    "e r" '(eval-region :wk identity)
    "e c" '(wr/tangle-and-reload-config :wk identity)

    "f" '(:ignore t :wk "find")
    "f f" '(find-file :wk identity)
    "f r" '(recentf-open-files :wk "recent files")
    "f u" '(sudo-edit-find-file :wk identity)
    "f U" '(sudo-edit :wk identity)
    "f 1" '(wr/open-config-org :wk "open config.org")
    ;; f g grep/ripgrep/ag

    "g" '(:ignore t :wk "git TODO")
    ;; gs magit
    ;; gb show branches
    ;; gB blame?
    ;; gBl blame line?
    ;; gc +commits
    ;; gcc show commits
    ;; gcb show branch commits
    ;; gf git file past versions?
    ;; gl git log all
    ;; gL git log branch

    "H" '(:ignore t :wk "help")
    "H f" '(describe-function :wk identity)
    "H F" '(describe-face :wk identity)
    "H v" '(describe-variable :wk identity)
    "H k" '(describe-key :wk identity)

    "n" '(:ignore t :wk "treemacs/nerdtree TODO")

    "o" '(:ignore t :wk "org TODO")

    "p" '(:ignore t :wk "harpoon TODO")

    "t" '(:ignore t :wk "terminal TODO")

    "w" '(:ignore t :wk "window")
    "w +" '(hydra-window-resize/body :wk "+height")
    "w -" '(hydra-window-resize/body :wk "-height")
    "w _" '(hydra-window-resize/body :wk "-height")
    "w <" '(hydra-window-resize/body :wk "-width")
    "w =" '(hydra-window-resize/body :wk "balance windows")
    "w >" '(hydra-window-resize/body :wk "+width")
    "w b" '(evil-window-bottom-right :wk identity)
    "w c" '(evil-window-delete :wk identity)
    "w d" '(evil-window-delete :wk identity)
    "w h" '(evil-window-left :wk identity)
    "w H" '(evil-window-move-far-left :wk identity)
    "w j" '(evil-window-down :wk identity)
    "w J" '(evil-window-move-very-bottom :wk identity)
    "w k" '(evil-window-up :wk identity)
    "w K" '(evil-window-move-very-top :wk identity)
    "w l" '(evil-window-right :wk identity)
    "w L" '(evil-window-move-far-right :wk identity)
    "w n" '(evil-window-new :wk identity)
    "w o" '(evil-window-other-windows :wk identity)
    "w p" '(evil-window-mru :wk identity)
    "w r" '(evil-window-rotate-downwards :wk identity)
    "w R" '(evil-window-rotate-upwards :wk identity)
    "w s" '(evil-window-split :wk identity)
    "w S" '(evil-window-split :wk identity)
    "w t" '(evil-window-top-left :wk identity)
    "w v" '(evil-window-vsplit :wk identity)
    "w w" '(evil-window-next :wk identity)
    "w W" '(evil-window-prev :wk identity)
    "w |" '(evil-window-set-width :wk identity)
    "w C-_" '(evil-window-set-height :wk identity)


    "." '(:ignore t :wk "multiple cursors TODO")
    ;; ./ select with regex
    ;; .. add cursor @ pos

    ";" '(:ignore t :wk "settings")
    "; l" '(display-line-numbers-mode :wk "toggle line numbers")
    "; RET" '(visual-line-mode :wk "toggle word wrap")
    ;; ;l toggle relative line numbers
    ;; ;L toggle line numbers
    ;; ;o toggle showing overlength (highlight characters past 80 char)
    ;; ;t +tabs/spaces
    ;; ;tt toggle between tabs and spaces
    ;; ;tc convert all to tabs / spaces
    ;; ;tw prompt for tab width
    ;; ;t1 set to 1 char tab width
    ;; ;t2 set to 1 char tab width
    ;; ;t3 set to 1 char tab width
    ;; ;t4 set to 1 char tab width
    ;; ;t8 set to 1 char tab width
    ;; ;w cycle between showing whitespace
    ;; ;SPC remove trailing spaces
    )


  (local-leader-keys
    :states '(normal visual insert emacs)
    :keymaps 'org-mode-map
    "#" '(org-insert-structure-template :wk "insert template")
    "y" '(org-store-link :wk identity)
    "p" '(org-insert-link :wk identity)))

(add-hook 'emacs-startup-hook
	  (lambda ()
	    (message "Emacs ready in %s with %d garbage collectios."
		     (format "%.2f seconds"
			     (float-time
			      (time-subtract after-init-time before-init-time)))
		     gcs-done)))
